------------------------------------------------------------
-- 6. 16 BlogPosts
------------------------------------------------------------
INSERT INTO BlogPost (StoreId, Title, Content, Published)
VALUES
(1, N'Как да изберем протеин',
    N'В тази статия ще разгледаме видовете протеин и кои са подходящи за различни цели. ', 1),
(1, N'Креатин – митове и истини',
    N'Често задавани въпроси за креатина и реалните научни данни. ', 1),
(1, N'BCAA или EAA - коя е по-добрата добавка? ',
    N'Сравнителен анализ между аминокиселините с разклонена верига и есенциалните аминокиселини.', 1),
(2, N'Витамин D3 - защо е толкова важен',
    N'Ролята на витамин D3 за имунитета, костите и настроението.', 1),
(2, N'Омега-3 от риба или от водорасли? ',
    N'Сравнение между животинския и растителния източник на омега-3 мастни киселини.', 1),
(3, N'Естествени начини за укрепване на имунитета',
    N'Билки и хранителни добавки които подпомагат имунната система.', 1),
(3, N'Пробиотиците и чревното здраве',
    N'Как пробиотиците влияят на храносмилането и общото здраве.', 1),
(4, N'Хидратация по време на тренировка',
    N'Защо изотоничните напитки са важни за спортуващите.', 1),
(1, N'Протеинови рецепти за след тренировка',
    N'5 лесни и вкусни рецепти с протеинов прах.', 0);
GO