------------------------------------------------------------
-- 6.15 Reviews
------------------------------------------------------------
INSERT INTO Review (CustomerId, ProductId, Rating, Comment)
VALUES
(1, 1, 5, N'Много добър вкус и разтворимост. Препоръчвам!'),
(1, 6, 4, N'Добър креатин, резултатите се виждат бързо. '),
(2, 15, 5, N'Идеален витамин D за зимата. Чувствам се по-енергична.'),
(2, 16, 5, N'Качествен витамин C, вкусът е приятен. '),
(3, 3, 5, N'Най-добрият изолат който съм пробвал! '),
(3, 8, 4, N'Добър BCAA, но може би малко скъп.'),
(1, 2, 5, N'Ванилията е любимият ми вкус!'),
(4, 25, 5, N'Ашвагандата наистина помага за стреса.'),
(5, 38, 3, N'Ефектът е добър, но имам лек стомашен дискомфорт.'),
(3, 22, 5, N'Качествено рибено масло без лош вкус.'),
(2, 19, 4, N'Добър магнезий, помага за съня.'),
(1, 11, 5, N'Вкусни протеинови барове, много удобни.'),
(4, 31, 5, N'Отличен пробиотик, храносмилането ми се подобри.'),
(5, 39, 4, N'CLA-то работи, но трябва да се комбинира с диета.');
GO