------------------------------------------------------------
-- 6.7 ProductCategory (M:N) - разширени връзки
------------------------------------------------------------
INSERT INTO ProductCategory (ProductId, CategoryId)
VALUES
-- Store 1 протеини
(1, 1), (2, 1), (3, 1), (4, 1), (5, 1),
-- Store 1 креатин
(6, 2), (7, 2),
-- Store 1 аминокиселини
(8, 3), (9, 3),
-- Store 1 pre-workout
(10, 4),
-- Store 1 снакове
(11, 5), (12, 5),
-- Store 1 екипировка
(13, 6), (14, 6),
-- Store 2 витамини
(15, 7), (16, 7), (17, 7), (18, 7),
-- Store 2 минерали
(19, 8), (20, 8), (21, 8),
-- Store 2 омега
(22, 9), (23, 9), (24, 9),
-- Store 3 билки
(25, 10), (26, 10), (27, 10),
-- Store 3 имунитет
(28, 11), (29, 11), (30, 11),
-- Store 3 пробиотици
(31, 12), (32, 12), (33, 12),
-- Store 4 спортни напитки
(34, 13), (35, 13),
-- Store 4 възстановяване
(36, 14), (37, 14),
-- Store 4 отслабване
(38, 15), (39, 15), (40, 15), (41, 15);
GO